Repository: RobotSquid/cms
Catalog: cms/locale/*/LC_MESSAGES/cms.po
Languages: af

source: N/A
af: N.V.T.

source: Not correct
af: Verkeerd

source: Correct
af: Korrek

source: Partially correct
af: Gedeeltelik korrek

source: Outcome
af: Uitslag

source: Details
af: Besonderhede

source: Execution time
af: Uitvoeringstyd

source: Memory used
af: Geheue gebruik

source: Score details temporarily unavailable.
af: Tellingsbesonderhede is tydelik nie beskikbaar nie.

source: Subtask %(index)s
af: Subtaak %(index)s

source: Compilation succeeded
af: Kompilasie het geslaag

source: Your submission successfully compiled to an executable.
af: Jou indiening is suksesvol gekompileer na 'n uitvoerbare.

source: Compilation failed
af: Kompilasie het misluk

source: Your submission did not compile correctly.
af: Jou voorlegging is nie korrek gekompileer nie.

source: Compilation timed out
af: Samestelling het te lank gevat om te loop.

source: Your submission exceeded the time limit while compiling. This might be caused by an excessive use of C++ templates, for example.
af: Jou indiening het die tydslimiet oorskry tydens kompilasie. Dit kon byvoorbeeld veroorsaak wees deur te veel C++ template te gebruik.

source: Compilation killed with signal %s (could be triggered by violating memory limits)
af: Kompilasie is getermineer met sein %s (kon veroorsaak wees deur oorskry van geheuelimiete)

source: Your submission was killed with the specified signal. Among other things, this might be caused by exceeding the memory limit for the compilation, and in turn by an excessive use of C++ templates, for example.
af: Jou indiening is getermineer met die gespesifiseerde sein. Dit mag onder meer veroorsaak wees deur die geheuelimiet te oorskry vir kompilasie, wat byvoorbeeld kan plaas vind as te veel C++ template gebruik word.

source: Output is correct
af: Uitslag is korrek

source: Your submission ran and gave the correct answer
af: Jou indiening het geloop en die korrekte antwoord gegee

source: Output is partially correct
af: Uitslag is gedeeltelik korrek

source: Your submission ran and gave the partially correct answer
af: Jou indiening het geloop en 'n gedeeltelik korrekte antwoord gegee

source: Output isn't correct
af: Uitslag is verkeerd

source: Your submission ran, but gave the wrong answer
af: Jou indiening het geloop maar die verkeerde antwoord gegee

source: Evaluation didn't produce file %s
af: Evaluasie het nie die lêer %s geproduseer nie.

source: Your submission ran, but did not write on the correct output file
af: Jou indiening het geloop, maar nie geskryf na die regte uitsetlêer nie

source: Execution timed out
af: Uitvoeringstyd oorskry

source: Your submission used too much CPU time.
af: Jou indiening het te veel SVE tyd gebruik.

source: Execution timed out (wall clock limit exceeded)
af: Uitvoeringstyd het uitgeloop (muurklok limiet oorskry)

source: Your submission used too much total time. This might be triggered by undefined code, or buffer overflow, for example. Note that in this case the CPU time visible in the submission details might be much smaller than the time limit.
af: Jou indiening het te veel totale tyd gebruik. Dit kon byvoorbeeld veroorsaak wees deur ongedefineÑ‘rde kode or bufferoorloop. Neem ag dat die SVE tyd sigbaar in die indieningsbesonderhede in die geval kleiner as die tydslimiet kan wees.

source: Execution killed (could be triggered by violating memory limits)
af: Uitvoering getermineer (kon veroorsaak wees deur geheuelimiete te oorskry)

source: The evaluation was killed by a signal. Among other things, this might be caused by exceeding the memory limit. Note that if this is the reason, the memory usage visible in the submission details is the usage before the allocation that caused the signal.
af: Die uitvoering is getermineer deur 'n sein. Dit kon byvoorbeeld veroorsaak wees deur die geheuelimiet te oorskry. Neem ag dat die geheuegebruik sigbaar in die indieningsbesonderhede in die geval die gebruik is voor die geheuetoekenning wat die sein veroorsaak het.

source: Execution failed because the return code was nonzero
af: Uitvoering het misluk omdat die terugkeerkode nie nul was nie

source: Your submission failed because it exited with a return code different from 0.
af: Jou indiening het misluk omdat dit gestop het met 'n terugkeerkode anders as 0.

source: Execution completed successfully
af: Uitvoering suksesvol voltooi

source: No compilation needed
af: Geen kompilasie nodig nie

source: File not submitted
af: Leêr nie ingedien nie

source: Question too long!
af: Vraag te lank!

source: Subject must be at most %(max_subject_length)d characters, content at most %(max_text_length)d.
af: Onderwerp mag maksimum %(max_subject_length)d karakters wees, inhoud maksimum %(max_text_length)d.

source: contest-token
af: wedstryd-teken

source: contest-tokens
af: wedstryd-tekens

source: task-token
af: taak-teken

source: task-tokens
af: taak-tekens

source: token
af: teken

source: tokens
af: tekens

source: You don't have %(type_pl)s available for this task.
af: Jy het nie %(type_pl)s beskikbaar vir die taak nie.

source: You have an infinite number of %(type_pl)s for this task.
af: Jy het 'n ontelbare hoeveelheid %(type_pl)s vir hierdie taak.

source: You start with no %(type_pl)s.
af: Jy begin met geen %(type_pl)s.

source: You start with one %(type_s)s.
af: Jy begin met een %(type_s)s.

source: Every minute
af: Elke minuut

source: you get another %(type_s)s,
af: kry jy nog 'n %(type_s)s,

source: up to a maximum of one %(type_s)s.
af: tot 'n maksimum van een %(type_s)s.

source: you get another %(type_s)s.
af: jy kry nog 'n %(type_s)s,

source: You don't get other %(type_pl)s.
af: Jy kry nie nog %(type_pl)s nie.

source: You can use a %(type_s)s every second
af: Jy kan 'n %(type_s)s elke sekonde gebruik,

source: and no more than one %(type_s)s in total.
af: en nie meer as een %(type_s)s in totaal nie.

source: You can use a %(type_s)s every second.
af: Jy kan 'n %(type_s)s elke sekonde gebruik.

source: You can use no more than one %(type_s)s in total.
af: Jy kan nie meer as een %(type_s)s in totaal gebruik nie.

source: You have no limitations on how you use them.
af: Jy het geen beperkings

source: Too many print jobs!
af: Te veel drukwerkstukke!

source: You have reached the maximum limit of at most %d print jobs.
af: Jy het die maksimum limiet van makisimum %d drukwerkstukke bereik.

source: Invalid format!
af: Ongeldige formaat!

source: Please select the correct files.
af: Kies asseblief die regte lêers.

source: File too big!
af: Lêer te groot!

source: Each file must be at most %d bytes long.
af: Elke lêer moet ten minste %d grepe lank wees.

source: Print job storage failed!
af: Drukwerkstukstoor het misluk!

source: Please try again.
af: Probeer asseblief weer.

source: Token request discarded
af: Tekenversoek weggegooi

source: Your request has been discarded because you have no tokens available.
af: Jou versoek is weggegooi omdat jy geen tekens oor het nie.

source: Your request has been discarded because you already used a token on that submission.
af: Jou versoek is weggegooi omdat jy al klaar 'n teken op daardie indiening gebruik het.

source: Question received
af: Vraag ontvang

source: Your question has been received, you will be notified when it is answered.
af: Jou vraag is ontvang, en jy sal laat weet word sodra dit beantwoord is.

source: Print job received
af: Drukwerkstuk ontvang

source: Your print job has been received.
af: Jou drukwerkstuk is ontvang.

source: Submission received
af: Indiening ontvang

source: Your submission has been received and is currently being evaluated.
af: Jou indiening is ontvang en word huidiglik geёvalueer.

source: Compiling...
af: Besig om te kompileer...

source: Evaluating...
af: Besig om te evalueer...

source: Scoring...
af: Besig om telling te kry...

source: Evaluated
af: Geёvalueer

source: Token request received
af: Tekenversoek ontvang.

source: Your request has been received and applied to the submission.
af: Jou versoek is ontvang en toegepas op die indiening.

source: Test received
af: Toets ontvang

source: Your test has been received and is currently being executed.
af: Jou toets is ontvang en word huidiglik uitgevoer.

source: details
af: besonderhede

source: Executing...
af: Besig om uit te voer...

source: Executed
af: Uitgevoer

source: Too many submissions!
af: Te veel indienings!

source: You have reached the maximum limit of at most %d submissions among all tasks.
af: Jy het die maksimum aantal van %d indienings oor alle take bereik.

source: You have reached the maximum limit of at most %d submissions on this task.
af: Jy het die maksimum aantal van %d indienings op hierdie taak bereik.

source: Submissions too frequent!
af: Indienings te gereeld!

source: Among all tasks, you can submit again after %d seconds from last submission.
af: Oor alle take kan jy eers %d sekondes na jou laaste indiening weer indien.

source: For this task, you can submit again after %d seconds from last submission.
af: Vir hierdie taak kan jy eers %d sekondes na jou laaste indiening weer indien.

source: Invalid archive format!
af: Ongeldige argiefformaat!

source: The submitted archive could not be opened.
af: Die ingediende argief kon nie oopgemaak word nie.

source: Invalid submission format!
af: Ongeldige indieningformaat!

source: Submission too big!
af: Indiening te groot!

source: Each source file must be at most %d bytes long.
af: Elke bronlêer moet ten minste %d grepe lank wees.

source: Submission storage failed!
af: Indieningstoor het misluk!

source: Too many tests!
af: Te veel toetse!

source: You have reached the maximum limit of at most %d tests among all tasks.
af: Jy het die maksimum aantal van %d toetse oor alle take bereik.

source: You have reached the maximum limit of at most %d tests on this task.
af: Jy het die maksimum aantal van %d toetse vir hierdie taak bereik.

source: Tests too frequent!
af: Toetse te gereeld!

source: Among all tasks, you can test again after %d seconds from last test.
af: Oor alle take kan jy eers %d sekondes na jou laaste toets weer toets.

source: For this task, you can test again after %d seconds from last test.
af: Vir hierdie taak kan jy eers %d sekondes na jou laaste toets weer toets.

source: Invalid test format!
af: Ongeldige toetsformaat!

source: Test too big!
af: Toets te groot!

source: Input too big!
af: Inset is te groot!

source: The input file must be at most %d bytes long.
af: Die insetlêer moet ten minste %d grepe lank wees.

source: Test storage failed!
af: Toetsstoor het misluk!

source: Communication
af: Kommunikasie

source: Announcements
af: Aankondigings

source: (no subject)
af: (geen onderwerp)

source: Questions
af: Vrae

source: Subject
af: Onderwerp

source: Text
af: Teks

source: Ask question
af: Vra 'n vraag

source: Reset
af: Herstel

source: no answer yet
af: geen antwoord nie

source: Messages
af: Boodskappe

source: Automatic (%(lang)s)
af: Outomaties (%(lang)s)

source: Logout
af: Teken uit

source: Logged in as <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>
af: Ingeteken as <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>

source: Failed to log in.
af: Kon nie aanmeld nie.

source: Welcome
af: Welkom

source: Please log in
af: Teken asseblief in

source: If you have previously registered for a contest, your account is valid for this contest as well
af: As jy voorheen vir 'n wedstryd gerigistreer het is jou rekening ook geldig vir hierdie wedstryd

source: Username
af: Gebruikersnaam

source: Password
af: Wagwoord

source: Forgot password?
af: Wagwoord vergeet?

source: Login
af: Teken in

source: Don't have an account?
af: Geen rekening nie?

source: Register
af: Registreer

source: Registration is disabled for this contest. Please contact the administrators if you should take part but do not know your login details
af: Registrasie is gedeaktiveer vir hierdie wedstryd. Kontak asseblief die beoordelaars as jy veronderstel is om deel te neem maar nie jou intekeningsbesonderede ken nie

source: E-mail
af: E-pos

source: New message
af: Nuwe boodskap

source: New announcement
af: Nuwe aankondiging

source: New answer
af: Nuwe antwoord

source: %d unread
af: %d ongelees

source: Until contest starts:
af: Totdat wedstryd begin:

source: Until contest ends:
af: Totdat wedstryd eindig

source: Until analysis starts:
af: Tot ontleding begin:

source: Until analysis ends:
af: Tot ontleding eindig:

source: Time left:
af: Tyd oor:

source: Server time:
af: Bediener tyd:

source: Overview
af: Oorsig

source: Rules & Instructions
af: Reëls & Instruksies

source: Statement
af: Stelling

source: Submissions
af: Indienings

source: Documentation
af: Dokumentasie

source: Testing
af: Toets

source: Printing
af: Drukwerk

source: Contest Management System
af: Wedstrydbestuurstelsel

source: is released under the
af: is vrygestel onder die

source: GNU Affero General Public License
af: GNU Affero Algemene Publieke Lisensie

source: Evaluator
af: Evalueerder

source: Contest Server
af: Wedstrydbediener

source: Choose a contest
af: Kies 'n wedstryd

source: Click
af: Klik

source: here
af: hier

source: to view documentation on how to use the evaluator.
af: om dokumentasie te wys oor hoe om die evalueerder te gebruik.

source: Alternatively, you can also watch a tutorial video
af: Alternatiewelik kan jy ook 'n tutoriaalvideo kyk

source: Programming languages and libraries
af: Programmeringstale en programbiblioteke

source: Standard Template Library
af: Standaard Templaat Programbiblioteek

source: The main Java class of the solution should have exactly the same name as the task.
af: Die hoof Java-klas van die oplossing moet presies dieselfde naam as die taak hê.

source: Java Documentation
af: Java Dokumentasie

source: Python 2 Documentation
af: Python 2 Dokumentasie

source: Python 3 Documentation
af: Python 3 Dokumentasie

source: Pascal Documentation
af: Pascal Dokumentasie

source: Delphi is simply a commercial implementation of Pascal, so if you're familiar with Delphi, then you can submit your solutions in Pascal.
af: Delphi is bloot 'n kommersiële impllementasie van Pascal, so as jy gewoon is aan Delphi kan jy jou oplossing instuur in Pascal.

source: be sure to use the provided templates to handle input/output
af: onthou om die gegewe template te gebruik om toevoer/afvoer te hanteer

source: Submission details for compilation
af: Indieningsbesonderhede vir die wedstryd

source: Message
af: Boodskap

source: Explanation
af: Verduideliking

source: Submission details for evaluation
af: Indieningsbesonderhede vir evaluasie

source: Error %(status_code)s
af: Fout %(status_code)s

source: An error occured while the server was handling your request.
af: 'n Fout het plaasgevind terwyl die bediener jou versoek hanteer het.

source: Note that attempts to tamper with Contest Management System (such as probing the server with customized URLs) may be considered cheating and may lead to disqualification.
af: Neem ag dat pogings om met Wedstrydbestuurstelsel te peuter (byvoorbeeld om die bediener met spesifieke URLs te probeer indring) as kullery gesien kan word en kan lei tot diskwalifikasie.

source: If you encountered this error during normal usage, please notify the contest administrators.
af: As jy hierdie fout teegekom het tydens normale gebruik, laat weet asseblief die wedstrydadministrateurs.

source: Contest Rules
af: Wedstrydreëls

source: This contest is for ALL Round 2 candidates.
af: Hierdie wedstryd is vir ALLE Rondte 2 kandidate.

source: There are 100 marks in total. The marks are allocated as follows: Question 1 is worth 15 marks, Question 2 is worth 22 marks, Question 3 is worth 28 marks, and Question 4 is worth 35 marks. The number of test cases for each question is hidden, although the marks for each test case will be evenly distributed across the mark allocation.
af: Daar is 100 punte in totaal. Die punte word toegeken as volg: Vraag 1 is 15 punte werd, Vraag 2 is 22 punte werd, Vraag 3 is 28 punte werd, en Vraag 4 is 35 punte werd. Die aantal toetsgevalle vir elke vraag word versteek, alhoewel die punte vir elke toetsgeval eweredig versprei sal wees oor die puntetoekenning.

source: You have two hours (120 minutes) to attempt as many questions as possible.
af: Jy het twee ure (120 minute) om so veel as moontlik vrae te voltooi.

source: You may assume that the user input will satisfy the problem specification and so you do not need to validate the input.
af: Jy mag aaneem dat die invoerdata sal ooreenstem met die probleemstelling en dat jy nie die invoer hoef te valideer nie.

source: You should not write code to produce only specific answers, as the judges will use other test cases.
af: Jy moet nie kode skryf om net spesifieke antwoorde te gee nie, aangesien die aanlyn beoordeelaar ander toetsgevalle sal gebruik.

source: Any attempt to access any other website or source of information will disqualify you, with the exception of online compilers such as
af: Enige poging om toegang te kry tot enige ander webtuiste of inligtingsbron sal jou diskwalifiseer, met die uitsondering van aanlynkompileerders soos

source: For programming language documentation, refer to the
af: Vir programmeertaaldokumentasie, verwys na die

source: link given on the pane on the left-hand side.
af: skakel gegee op die paneel aan die linkerkant.

source: Any submissions on the evaluator should <b>NOT</b> attempt any of the following:
af: Enige indienings op die evaluaeerder moet <b>NIE</b> enige van die volgende probeer doen <b>NIE</b>:

source: access the internal evaluation server network,
af: toegang probeer kry tot die interne evalueernetwerk,

source: fork or execute external programs,
af: enige ander program vurk of uitvoer,

source: create or access files,
af: toegang kry tot leêrs of leêrs skep,

source: attack the system security or the grader,
af: die stelselsekuriteit of gradeerder aanval,

source: change file system permissions, or
af: leêrstelselregte verander, of

source: read file system information.
af: leêrstelselinformasie lees.

source: A competitor whose submissions attempt any of the above may be disqualified.
af: 'n Mededinger wie se indienings enige van die bogenoemde probeer doen mag gediskwalifiseer word.

source: Do not communicate the task statements or nature of the problems with other students from different schools until after 6:30 PM on 19 August.
af: Moet nie die taakstellings of aard van die probleme met enige studente van ander skole voor 6:30 PM 19 Augustus deel nie.

source: Scores per question will be sent to your school after 21 August. Scores will also be available on the online evaluator after 6:30 PM, once all submissions have been evaluated.
af: Tellings per vraag sal na you skool gestuur word na 21 Augustus. Tellings sal ook beskikbaar wees op die aanlyn beoordeelaar na 6:30 PM, sodra alle indienings geëvalueer is.

source: Instructions
af: Instruksies

source: Verify that your full name give on the bar in the top right hand corner is correct.
af: Maak seker dat you volle naam soos gegee in die hoek regs bo korrek is.

source: If there are errors, then
af: As daar foute is,

source: submit a question
af: dien dan 'n vraag in

source: with the subject heading "<b>Full Name</b>", and in the body of the question, simply give your correct full name.
af: met die onderwerp-opskif "<b>Volle Naam</b>", en in die boodskap van die vraag, gee bloot you korrekte volle naam.

source: Once you are ready to begin the contest, click on "<b>Start</b>". This sets the clock (top left) running. The Second Round questions will appear on the pane on the left-hand side.
af: Sodra jy reg is om die wedstryd te begib, klik op "<b>Start</b>". Dit sal die stophorlosie (bo links) begin. Die Tweede Rondte vrae sal verskyn op die paneel aan die linkerkant.

source: You will now have two hours (120 minutes) to complete all 4 questions.
af: Jy sal nou twee ure (120 minute) hê om al 4 vrae te beantwoord.

source: Click on "Statement", underneath the first question you wish to answer. Click on either "Statement in <b>English</b>" or "Statement in <b>Afrikaans</b>", depending on which language you wish to use.
af: Klik op "Stelling", onder die eerste vraag wat jy wil antwoord. Klik op "Stelling in <b>English</b>" of "Stelling in <b>Afrikaans</b>, afhangend van die taal wat jy wil gebruik.

source: Using the template files, or otherwise, write a program to solve the problem. Cut and paste or type the program in the template provided for your language.
af: Skryf 'n program om die probleem op te los, moontlik deur die templaatleêrs te gebruik. Sny en plak of tik die program in die templaat gegee vir jou taal.

source: Click on "Submissions". Click "Choose File", and select the source code of your program you wish to submit.
af: Klik op "Indienings". Klik "Kies leêr", en kies die bronkode van die program wat jy wil indien.

source: Select the relevant programming language, and then click "Submit".
af: Kies die relevante programmeertaal, en klik dan "Dien in"

source: You will only receive feedback for the example test cases given in the task statement (to ensure that the format of your output is correct). No feedback will be given for any further test cases. The evaluator will simply display your score as "N/A" for the duration of the contest.
af: Jy sal slegs terugvoer ontvang vir die voorbeeldtoetsgevalle gegee in die taakstelling (om te verseker dat die formaat van jou afvoer korrek is). Geen terugvoer sal gegee word vir enige verdere toetsgevalle nie. Die evalueerder sal slegs jou telling aandui as "N.V.T" vir die res van die kompetisie.

source: For each question, your score will be the highest score obtained across all your submissions for that question. You will only be permitted to submit at most 25 submissions for each question.
af: Vir elke vraag sal jou telling die hoogste punt wees wat jy oor al jou indienings vir daardie vraag gekry het. Jy sal slegs toegelaat word om 'n maksimum van 25 keer 'n oplossing in te dien vir elke vraag.

source: You may use the
af: Jy mag die

source: (top of left pane) but note that responses may be delayed.
af: gebruik (bokant van linkerpaneel), maar neem ag dat die antwoord vertraag mag wees.

source: Select a new question from the list on the left.
af: Kies 'n nuwe vraag van die lys aan die linkerkant.

source: Do not wait until the last few minutes to submit your programs.
af: Moet nie wag tot die laaste paar minute om jou programme in te handig nie.

source: After 120 minutes, or at 6:30 PM, whatever comes first, the server will end your participation. Should you finish before the time, check that you have answered all the questions.
af: Na 120 minute, of teen 6:30 PM, watookal eerste kom, sal die aanlyn beoordeelaar jou deelname beindig. Indien jy voor die tyd klaar is, maak seker dat jy al die vrae beantwoord het.

source: General information
af: Algemene inligting

source: The contest hasn't started yet.
af: Die wedstryd het nog nie begin nie.

source: The contest will start at %(start_time)s and will end at %(stop_time)s.
af: Die wedstryd sal om %(start_time)s begin en om %(stop_time)s eindig.

source: The contest is currently running.
af: Die wedstryd is tans aan die gang.

source: The contest started at %(start_time)s and will end at %(stop_time)s.
af: Die wedstryd het om %(start_time)s begin en sal om %(stop_time)s eindig.

source: The contest has already ended.
af: Die wedstryd het al reeds geёindig.

source: The contest started at %(start_time)s and ended at %(stop_time)s.
af: Die wedstryd het om %(start_time)s begin en om %(stop_time)s geёindig.

source: The analysis mode hasn't started yet.
af: Die ontledingsfase het nog nie begin nie.
