Repository: RobotSquid/cms
Catalog: cms/locale/*/LC_MESSAGES/cms.po
Languages: af

source: The analysis mode will start at %(start_time)s and will end at %(stop_time)s.
af: Die ontledingsfase sal om %(start_time)s begin en om %(stop_time)s eindig.

source: The analysis mode is currently running.
af: Die ontledingsfase is tans aan die gang.

source: The analysis mode started at %(start_time)s and will end at %(stop_time)s.
af: Die ontledingsfase het om %(start_time)s begin en sal om %(stop_time)s eindig.

source: The analysis mode has already ended.
af: Die ontledingsfase het al reeds geёindig.

source: The analysis mode started at %(start_time)s and ended at %(stop_time)s.
af: Die ontledingsfase het om %(start_time)s begin en om %(stop_time)s geёindig.

source: You have an infinite number of tokens.
af: Jy het 'n ontelbare hoeveelheid tekens.

source: You can see the detailed result of a submission by using a token on it.
af: Jy kan gedetailleerde resultate van 'n indiening sien deur 'n teken op dit te gebruik.

source: Your score for each task will be the maximum among the tokened submissions and the last one.
af: Jou telling vir elke taak sal die maksimum oor al die getekende indienings en die laaste indiening wees.

source: You have a distinct set of tokens for each task.
af: Jy het 'n aparte aantal tekens vir elke taak.

source: You can find the rules for the %(type_pl)s on each task's description page.
af: Jy kan die reёls vir die %(type_pl)s op elke taak se beskrywingsbladsy kry.

source: You have a set of tokens shared among all tasks.
af: Jy het 'n vasgestelde aantal tekens gedeel deur alle take.

source: You have two types of tokens: a set of <em>contest-tokens</em> shared among all tasks and a distinct set of <em>task-tokens</em> for each task.
af: Jy het twee tipes tekens: 'n vasgestelde aantal <em>wedstryd-tekens</em> gedeel deur alle take en 'n aparte aantal <em>toets-tekens</em> vir elke taak.

source: You can see the detailed result of a submission by using two tokens on it, one of each type.
af: Jy kan die gedetailleerde resultate van 'n indiening sien deur twee tekens op dit te gebruik, een van elke tipe.

source: You can submit at most %(submissions)s solutions during this contest.
af: Jy kan 'n maksimum van %(submissions)s oplossings gedurende die wedstryd indien.

source: You can submit at most %(user_tests)s user tests during this contest.
af: Jy kan 'n maksimum van %(user_tests)s toetse gedurende die wedstryd indien.

source: Every user is allowed to compete (i.e. submit solutions) for a uninterrupted time frame of %(per_user_time)s.
af: Elke gebruiker word toegelaat om deel te neem (m.a.w. oplossings in te dien) vir 'n ononderbroke tydsraam van %(per_user_time)s.

source: As soon as the contest starts you can choose to start your time frame.
af: Jy kan jou tydsraam bein sodra die wedstryd begin het.

source: Once you start, you can submit solutions until the end of the time frame or until the end of the contest, whatever comes first.
af: Sodra jy begin het kan jy oplossings indien tot die einde van jou tydsraam of die einde van die wedstryd, watookal eerste plaasvind.

source: By clicking on the button below you can start your time frame.
af: Jy kan jou tydsraam begin deur die knoppie onder te klik.

source: You started your time frame at %(start_time)s.
af: Jy het jou tydsraam begin om %(start_time)s.

source: You can submit solutions until the end of the time frame or until the end of the contest, whatever comes first.
af: Jy kan oplossings indien tot die einde van jou tydsraam of die einde van die wedstryd, watookal eerste plaasvind.

source: You started your time frame at %(start_time)s and you already finished it.
af: Jy het jou tydsraam begin om %(start_time)s en dit alreeds voltooi.

source: There's nothing you can do now.
af: Daar is niks wat jy nou kan doen nie.

source: You never started your time frame. Now it's too late.
af: Jy het nooit jou tydsraam begin nie. Nou is dit te laat.

source: Start!
af: Begin!

source: Task overview
af: Taak oorsig

source: Task
af: Taak

source: Name
af: Naam

source: Time limit
af: Tydslimiet

source: Memory limit
af: Geheuelimiet

source: Type
af: Tipe

source: Files
af: Lêers

source: Tokens
af: Tekens

source: Yes
af: Ja

source: No
af: Nee

source: Username doesn't exist.
af: Gebruikersnaam bestaan nie.

source: Please enter your username and email address below to request a password reset.
af: Voer asseblief jou gebruikersnaam en e-pos adres onder in om 'n wagwoordherstel aan te vra.

source: Request Reset
af: Versoek Herstel

source: Password reset request has been succesfully logged.
af: Wagwoordherstelaanvraag is suksesvol ingedien.

source: You should receive an e-mail within 24 hours with your new password.
af: Jy behoort 'n e-pos binne 24 ure te ontvang met jou nuwe wagwoord.

source: If no email is received, please let us know here
af: Indien geen e-pos ontvang is nie, laat ons asseblief hier weet

source: Back to login
af: Terug na aanmeld

source: Print
af: Druk

source: You can print %(remaining_jobs)s more text or PDF files of up to %(max_pages)s pages each.
af: Jy kan nog %(remaining_jobs)s PDF- of tekslêers druk, met 'n maksimum van %(max_pages)s bladsye elk.

source: You can print %(remaining_jobs)s more text files of up to %(max_pages)s pages each.
af: Jy kan nog %(remaining_jobs)s tekslêers druk, met 'n maksimum van %(max_pages)s bladsye elk.

source: File (text or PDF)
af: Lêer (teks of PDF)

source: File (text)
af: Lêer (teks)

source: Submit
af: Dien in

source: You cannot print anything any more as you have used up your printing quota.
af: Jy kan niks meer druk nie omdat jy jou drukkwota opgebruik het.

source: Previous print jobs
af: Vorige drukwerkstukke

source: Date and time
af: Datum en tyd

source: Time
af: Tyd

source: File name
af: Lêernaam

source: Preparing...
af: Voorbereiding ...

source: no print jobs yet
af: geen drukwerkstukke sover nie

source: The passwords do not match!
af: Die wagwoorde pas nie!

source: This username is already taken, please choose a different one.
af: Hierdie gebruikersnaam is klaar gevat, kies asseblief 'n ander een.

source: New user
af: Nuwe gebruiker

source: Please fill in the fields to register
af: Vul asseblief die velde in om te registreer.

source: First name
af: Voornaam

source: Last name
af: Van

source: School
af: Skool

source: Must be one character or more.
af: Moet een of meer karakters wees.

source: Confirm password
af: Bevestig wagwoord

source: The user was created successfully!
af: Die gebruiker is suskesvol geskep!

source: Your username is:
af: Jou gebruikersnaam is:

source: The password you chose was stored securely.
af: Die wagwoord wat jy gekies het is veilig gestoor.

source: You are now registered across all available public contests.
af: Jy is nou geregistreer oor alle beskikbare aanlynwedstryde.

source: Try practice contest
af: Probeer oefenwedstryd

source: Contest list
af: Wedstrydlys

source: Representing
af: Verteenwoordig

source: Compilation output
af: Kompilasieuitslag

source: Compilation outcome:
af: Kompilasie-uitkoms:

source: Compilation time:
af: Kompilasietyd:

source: Memory used:
af: Geheuegebruik:

source: Standard output
af: Standaard afvoer

source: Standard error
af: Standaard fout

source: %(name)s (%(short_name)s) <small>description</small>
af: %(name)s (%(short_name)s) <small>beskrywing</small>

source: no statement available
af: geen stelling beskikbaar

source: Download task statement
af: Laai taakstelling af

source: Statement in <b>%(lang)s</b>
af: Stelling in <b>%(lang)s</b>

source: Statement in %(lang)s
af: Stelling in %(lang)s

source: The statement for this task is available in multiple versions, in different languages.
af: Die stelling vir die taak is beskikbaar in verskillende weergawes, in verskillende tale.

source: You can see (and download) all of them using the list on the right.
af: Jy kan hulle almal sien (en aflaai) deur die lys aan die regterkant te gebruik.

source: Some suggested translations follow.
af: Sommige voorgestelde translasies volg.

source: Some details
af: Sommige besonderhede

source: You can find the rules for the %(type_pl)s on the <a href="%(contest_root)s">contest overview page</a>.
af: Jy kan die reёls vir die %(type_pl)s vind op die <a href="%(contest_root)s">wedstryd oorsigblad</a>.

source: Remember that to see the detailed result of a submission you need to use both a contest-token and a task-token.
af: Onthou, om die gedetailleerde resultate van 'n indiening te sien moet jy beide 'n wedstryd-teken en 'n taak-teken gebruik.

source: Attachments
af: Aanhegsels

source: unknown
af: onbekend

source: loading...
af: laai tans...

source: %(name)s (%(short_name)s) <small>submissions</small>
af: %(name)s (%(short_name)s) <small>indienings</small>

source: Score:
af: Telling:

source: Public score:
af: Publieke telling:

source: Score of tokened submissions:
af: Telling van getekende indienings:

source: Total score:
af: Totale telling:

source: Submit a solution
af: Dien 'n oplossing in

source: You may submit any subset of outputs in a single submission.
af: Jy mag enige onderafdeling van uitslae in 'n enkele indiening instuur.

source: You can submit %(submissions_left)s more solution(s).
af: Jy kan nog %(submissions_left)s oplossings indien.

source: submission.zip
af: indiening.zip

source: Previous submissions
af: Vorige indienings

source: Tokens are not allowed on this task.
af: Tekens word nie toegelaat in hierdie taak nie.

source: Right now, you have infinite tokens available on this task.
af: Jy het huidiglik ontelbare tekens beskikbaar vir hierdie taak.

source: Right now, you have one token available on this task.
af: Jy het huidiglik een teken beskikbaar vir hierdie taak.

source: Right now, you have %(tokens)s tokens available on this task.
af: Jy het huidiglik %(tokens)s tekens beskikbaar vir hierdie taak.

source: But you have to wait until %(expiration_time)s to use them.
af: Jy moet egter wag tot %(expiration_time)s om hulle te gebruik.

source: You will receive a new token at %(gen_time)s.
af: Jy sal 'n nuwe teken om %(gen_time)s ontvang.

source: In the current situation, no more tokens will be generated.
af: In die huidiglike situasie sal geen meer tekens gegenereer word nie.

source: Right now, you do not have tokens available for this task.
af: Jy het huidiglik geen tekens beskikbaar vir hierdie taak nie.

source: But you will have to wait until %(expiration_time)s to use it.
af: Jy moet egter wag tot %(expiration_time)s om dit te gebruik.

source: Unofficial submissions
af: Onffisieёle indienings

source: Official submissions
af: Offisieёle indienings

source: Submission details
af: Indieningsbesonderhede

source: Close
af: Maak toe

source: Download
af: Laai af

source: Submit a test
af: Dien 'n toets in

source: You can submit %(user_tests_left)s more test(s).
af: Jy kan nog %(user_tests_left)s toetse indien.

source: input
af: inset

source: Previous tests
af: Vorige toetse

source: Input
af: Inset

source: Output
af: Uitset

source: no tests yet
af: nog geen toetse nie

source: Test details
af: Toetsbesonderhede

source: Evaluation outcome
af: Evaluasieuitkoms

source: Wait...
af: Wag...

source: None
af: Geen

source: Public score
af: Publieke telling

source: Total score
af: Totale telling

source: Score
af: Telling

source: Token
af: Teken

source: no submissions
af: geen indienings

source: Played
af: Gespeel

source: Play!
af: Speel!

source: No tokens
af: Geen tekens

source: The contest will open at 6 AM Wednesday 19 August and will shutdown at 6 PM.
af: Die kompetisie open Woensdag 19 Augustus om 06:00 en sluit om 18:00.

source: This paper is only for invited Round 2 candidates. They will see the questions and submit programs on the saco-evaluator.
af: Hierdie vraestel is slegs vir genooide Rondte 2 kandidate. Hulle sal die vrae sien en programme op die saco-evalueerder indien.

source: Programs must pass the plagiarism check to be deemed valid.
af: Programme moet die plagiaatkontrole slaag om as geldig te wees.

source: Log on using the username and password given to you by your teacher.
af: Teken aan met die gebruikersnaam en wagwoord wat jou onderwyser aan jou gegee het.

source: There are four questions. There are 100 marks for each question. Each question is made up of subtasks. There are different marks for each subtask.
af: Daar is vier vrae en elke vraag het ‘n totaal van 100 punte. Elke vraag bestaan uit subtake. Daar is verskillende punte vir elke subtaak.

source: For each subtask, your score will be the highest score obtained across all your submissions for that question.
af: Vir elke subtaak is jou telling die hoogste telling wat behaal is in al jou inhadigings vir daardie vraag.

source: You will have two hours (120 minutes) to complete all 4 questions.
af: Jy het twee uur (120 minute) om al 4 vrae te beantwoord.

source: You will only be permitted to submit at most 30 submissions for the 2 hours of the contest.
af: Jy mag ‘n maksimum van 30 inhandigings in die twee uur van die kompetisie indien.

source: After 120 minutes, or at 6:00 PM, whatever comes first, the server will end your participation. Should you finish before the time, check that you have answered all the questions.
af: Na 120 minute, of om 18:00, of wat ook al eerste kom, sal die bediener jou deelname beëindig. As jy voor die tyd klaar is, maak seker dat jy al die vrae beantwoord het.

source: Scores per question will be sent to your school after 19 August.
af: Die punte per vraag sal na 19 Augustus na jou skool gestuur word.

source: Delphi/Pascal users may want to use the int64 datatype for numbers, to ensure you do not get integer overflow (e.g. on the evaluator, the 'integer' datatype is 16-bit).
af: Delphi/Pascal gebruikers mag dalk die int64 datatipe wil gebruik vir nommers, om seker te maak dat dat jy nie heelgetal-oorvloei kry nie (b.v. op die evalueerder is die 'integer'-datatipe 16-bit).

source: Your program should not output anything other than the answer. E.g. if you are asked to read in two integers A and B and print out their sum, you must print out ONLY the value of A+B. If your program prints out anything else, such as 'Enter A and B:', you will get ZERO.
af: Jou program moet nie enige iets behalwe die antwoord uitvoer nie. B.v as jy gevra word om twee nommers A en B te lees en hul som uit te voer moet jy SLEGS die waarde van A+B uitvoer. As jou program enige iets anders uitvoer, soos 'Voer A en B in:', sal jy NUL kry.

source: The 64-bit integer datatypes in each language (Python handles by default) are
af: Die 64-bit heelgetal datatipes in elke programmeertaal (Python het geen verandering nodig nie) is

source: For more help, look at
af: Vir meer hulp, kyk na

source: Python users should make sure to select the correct version of Python when submitting their solutions, as the automatic detector may choose the wrong version.
af: Python gebruikers moet seker maak om die regte weergawe van Python te kies wanneer hulle oplossings inhanding, aangesien die outomatiese proses die verkeerde weergawe mag kies.

source: You may code your solutions in C++, Java, Python2, Python3 or Pascal/Delphi. The time multipliers are
af: Jy mag jou oplossings programmeer in C++, Java, Python2, Python3 of Pascal/Delphi. Die tydvermenigvuldigers is

source: For example, if the time limit given is 1 second, a Java solution may run for up to 2 seconds.
af: Byvoorbeeld, as die tydlimit gegee word as 1 sekonde, mag 'n Java oplossing tot 2 sekondes vat om te evalueer.
